benchmarks/runpod_b200/benchmark_results_GLM7.5_32b_b200/run_1_TP8_DP1_CTX8192_C100_P100_O128.txt
BENCHMARK: run_1_TP8_DP1_CTX8192_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72587cab11c0>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=8192, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='/workspace/glm47', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_GLM7.5_32b_b200', result_filename='run_1_TP8_DP1_CTX8192_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-8529da3e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-29 07:10:07 [datasets.py:612] Sampling input_len from [8192, 8192] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:19<31:30, 19.10s/it]
  3%|▎         | 3/100 [00:19<08:04,  5.00s/it]
  9%|▉         | 9/100 [00:19<01:50,  1.21s/it]
 15%|█▌        | 15/100 [00:19<00:50,  1.69it/s]
 21%|██        | 21/100 [00:19<00:27,  2.88it/s]
 27%|██▋       | 27/100 [00:19<00:16,  4.49it/s]
 33%|███▎      | 33/100 [00:19<00:10,  6.62it/s]
 39%|███▉      | 39/100 [00:19<00:06,  9.39it/s]
 45%|████▌     | 45/100 [00:20<00:04, 12.86it/s]
 51%|█████     | 51/100 [00:20<00:02, 17.07it/s]
 58%|█████▊    | 58/100 [00:20<00:01, 23.09it/s]
 65%|██████▌   | 65/100 [00:20<00:01, 28.42it/s]
 73%|███████▎  | 73/100 [00:20<00:00, 35.11it/s]
 81%|████████  | 81/100 [00:20<00:00, 41.90it/s]
 91%|█████████ | 91/100 [00:20<00:00, 51.96it/s]
100%|██████████| 100/100 [00:20<00:00,  4.81it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  20.77     
Total input tokens:                      819200    
Total generated tokens:                  12800     
Request throughput (req/s):              4.81      
Output token throughput (tok/s):         616.18    
Peak output token throughput (tok/s):    2600.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          40051.47  
---------------Time to First Token----------------
Mean TTFT (ms):                          8347.00   
Median TTFT (ms):                        8332.26   
P99 TTFT (ms):                           16084.45  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          92.07     
Median TPOT (ms):                        92.37     
P99 TPOT (ms):                           146.15    
---------------Inter-token Latency----------------
Mean ITL (ms):                           92.07     
Median ITL (ms):                         39.43     
P99 ITL (ms):                            319.20    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          20040.33  
Median E2EL (ms):                        20063.32  
P99 E2EL (ms):                           20751.09  
==================================================